Autodesk.Revit.DB.PatternPlacer.#ctor(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,System.Boolean)
Constructor.
origin:
Origin of the pattern on this face mapping the bottom left corner of the material.
dir:
Direction of the pattern placement (rotate the material in the face's UV coordinate plane around origin).
mirror:
Mirror the pattern (rotate the direction another 180 degrees).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.PatternPlacer
This class defines the pattern placement of material on a face.
This works together with the material settings defined in Texture Editor.